{ lib, ... }:

{
  services.openssh = {
    enable = lib.mkDefault true;
    settings.Banner = builtins.toFile "sshd-banner" ''
      ╔══════════════════════════════════════════════════════════════╗
      ║                                                              ║
      ║             ╦   ╦ ╔╗  ╦═╗ ╔═╗ ╔═╗  ╔═╗  ╦═╗ ╔╦╗              ║
      ║             ║   ║ ╠╩╗ ╠╦╝ ║╣  ╠═╝  ║ ║  ╠╦╝  ║               ║
      ║             ╩═╝ ╩ ╚═╝ ╩╚═ ╚═╝ ╩    ╚═╝  ╩╚═  ╩               ║
      ║                                                              ║
      ║              Free Reverse Proxy Infrastructure               ║
      ║                                                              ║
      ╠══════════════════════════════════════════════════════════════╣
      ║  WARNING: Unauthorized access is strictly prohibited         ║
      ║  All connections are monitored and logged                    ║
      ╚══════════════════════════════════════════════════════════════╝
    '';
    settings.PermitRootLogin = lib.mkDefault "no";
    settings.PasswordAuthentication = false;
    ports = [22];
    # extraConfig = ''
    #   AuthenticationMethods publickey,password
    # '';
  };
}
